import 'package:cloud_firestore/cloud_firestore.dart';
import 'package:flutter/material.dart';
import 'package:pas_service/features/user/models/iuser.dart';

class TestPage extends StatefulWidget {
  const TestPage({super.key, required this.id});
  final String id;

  @override
  State<TestPage> createState() => _TestPageState();
}

class _TestPageState extends State<TestPage> {
  int currentIndex = 0;
  List<Map<String, dynamic>> testData = [
    {
      'title': '1. Жобаның ұйымдық құрылымы:',
      'right':
          'жобаны жүзеге асыру үшін қажетті орындаушылардың рөлдерін анықтау, олардың арасындағы байланыстарды анықтау және тапсырмаларды орындау үшін жауапкершілікті бөлу',
      'answers': [
        'жобаны жүзеге асыру үшін қажетті орындаушылардың рөлдерін анықтау, олардың арасындағы байланыстарды анықтау және тапсырмаларды орындау үшін жауапкершілікті бөлу',
        'қандай да бір ақпараттық технологияны қолдану немесе құрумен байланысты іс-әрекет',
        'жобаның мақсаттарына қол жеткізуді қамтамасыз ету үшін жоба өтуі тиіс кезеңдердің реттілігі',
        'орындалатын функционалдық талаптар, яғни белгілі бір жағдайларда жүйенің пайдаланушыларға қажетті мәселелерді шешу мүмкіндігі',
        'өзгертулер туралы барлық сұрауларды қарау, оларды бекіту және нәтижелерді, процедуралар мен саясаттарды және жобалық құжаттарды өзгертуді басқару'
      ]
    },
    {
      'title': '2. Жобаның сапасын қамтамасыз ету кезеңіндегі негізгі міндет:',
      'right':
          'стратегияларды, стандарттарды және процедураларды алдағы кезеңнің міндеттеріне сәйкес келетіндей етіп нақтылау',
      'answers': [
        'стратегияларды, стандарттарды және процедураларды алдағы кезеңнің міндеттеріне сәйкес келетіндей етіп нақтылау',
        'өзгертулер туралы барлық сұрауларды талдау, оларды бекіту және нәтижелерді, процедуралар мен саясаттарды және жобалық құжаттарды өзгертуді басқару',
        'жоба деректерін жинау және шығындар, кестені орындау, техникалық және сапа барысы туралы есептерді құру',
        'нөлдік бос жүріспен транзакциялар нөлдік емес босаңсумен операцияларға қарағанда қатаң бақылауды аз талап етеді',
        'қандай да бір ақпараттық желіні пайдалану немесе құрумен байланысты тапсырмалар'
      ]
    },
    {
      'title': '3. Жобаның мақсаты:',
      'right':
          'Жобаны жүзеге асыру барысында қол жеткізгісі келетін жалпы нәтижелерді тұжырымдайтын мәлімдеме',
      'answers': [
        'Жобаны жүзеге асыру барысында қол жеткізгісі келетін жалпы нәтижелерді тұжырымдайтын мәлімдеме',
        'Жобаны жүзеге асыру барысында кездесуге тура келетін тұжырымдалған мәселе',
        'Жобаның нәтижелері бойынша бастапқы шарттар мен соңғы нәтижені кешенді бағалау',
        'ақпарат, орындалатын функционалдық талаптар, яғни жүйенің есептерді шешу мүмкіндігі',
        'нәтижелерге, процедуралар мен саясаттарға және жобалық құжаттарға өзгерістерді бекіту және басқару'
      ]
    },
    {
      'title': '4. Жобаны іске асыру – бұл:',
      'right':
          'Жобада сипатталған оның мақсатына жетуге бағытталған барлық әрекеттерді кешенді түрде жүзеге асыру',
      'answers': [
        'Жобада сипатталған оның мақсатына жетуге бағытталған барлық әрекеттерді кешенді түрде жүзеге асыру',
        'Стандартты мерзімде жобаны аяқтау үшін қажетті жағдайларды жасау',
        'Жобаның орындалу барысын бақылау, реттеу және талдау және тапсырмаларды орындау үшін жауапкершілікті тағайындау',
        'Жобалық жұмыстар кешенін аяқтауға кеткен уақытты басқару',
        'Күтілетін пайданың жүзеге асатынын және қалай болатынын анықтауға мүмкіндік береді'
      ]
    },
    {
      'title': '5. Жобаның процестік әрекеттен айырмашылығы мынада:',
      'right':
          'Процестер бір типті және циклді, жоба өзінің мақсаты мен жүзеге асыру әдістері бойынша бірегей, сонымен қатар нақты басталу және аяқталу мерзімдері бар',
      'answers': [
        'Процестер бір типті және циклді, жоба өзінің мақсаты мен жүзеге асыру әдістері бойынша бірегей, сонымен қатар нақты басталу және аяқталу мерзімдері бар',
        'Процестің бір түрін жүзеге асыру үшін бір немесе екі орындаушы қажет, жобаны жүзеге асыру үшін көптеген орындаушылар қажет',
        'Күтілетін кірісті жоғалту түріндегі қолайсыз қаржылық салдары бар жобаларға қарағанда қысқа мерзімде процестер',
        'Жобаны желілік жоспарлауда «оқиға» элементі санмен, ерте және кеш мерзіммен сипатталады',
        'Күтілетін кірісті жоғалту түріндегі жағымсыз саясат салдарының ықтималдығы'
      ]
    },
    {
      'title':
          '6. Төмендегілердің қайсысы жобалық ұйымдық құрылымның артықшылығына жатпайды?',
      'right': 'Адамдар мен жабдықтардың бірігуі жобалар арқылы жүзеге асады',
      'answers': [
        'Адамдар мен жабдықтардың бірігуі жобалар арқылы жүзеге асады',
        'Ұжымдық жұмыс және тиістілік сезімі',
        'Байланыс желілерінің қысқаруы',
        'Жоспарланған кәсіпкерлік пайдаға қол жеткізуді талдау',
        'Адам ресурстарының қолжетімділігін және жүктемесін бағалау'
      ]
    },
    {
      'title':
          '7. Жоба сапасын бақылауды ұйымдастыру және жүргізу процестеріне не кіреді?',
      'right': 'Есеп берумен аралық және соңғы сапаны бақылау',
      'answers': [
        'Есеп берумен аралық және соңғы сапаны бақылау',
        'Кемшіліктер мен ауытқулар тізімін жасау',
        'Алынған нәтижелердің сәйкестігін тексеру',
        'Жоба өнімінің тұтынушылары',
        'Жоба тәуекелдерін басқару'
      ]
    },
    {
      'title':
          '8. Жобаның бастапқы кезеңінде ресурстардың қандай бөлігі жұмсалады?',
      'right': '9-15%',
      'answers': [
        '9-15%',
        '15-30%',
        '45% дейін',
        '50% жоғары',
        '10%-дан аспайды'
      ]
    },
    {
      'title': '9. Жобаны жүзеге асыруға қандай факторлар көбірек әсер етеді?',
      'right': 'Экономикалық және құқықтық',
      'answers': [
        'Экономикалық және құқықтық',
        'Экономикалық және ұйымдастырушылық',
        'Экономикалық және әлеуметтік',
        'Экономикалық және ұжымдық',
        'Экономикалық және еңбек'
      ]
    },
    {
      'title': '10. Белгілі кезең дегеніміз не?',
      'right':
          'Жобаның жүзеге асу барысын бақылау үшін қолданылатын маңызды оқиға',
      'answers': [
        'Жобаның жүзеге асу барысын бақылау үшін қолданылатын маңызды оқиға',
        'Логикалық өзара байланысты процестер, олардың орындалуы жобаның мақсаттарының біріне қол жеткізуге әкеледі.',
        'Жобаны жүзеге асыру үшін бірізді әрекеттер жиынтығы',
        'Жобаға қатысатын немесе жобаны жүзеге асыру барысында мүдделері қозғалуы мүмкін заңды тұлғалар',
        'Жобаны жүзеге асыру нәтижесінде өндірісі қамтамасыз етілуі тиіс тауарлар мен қызметтердің жиынтығы'
      ]
    },
    {
      'title': '11. Инвестициялық жобалардың айрықша белгісін атаңыз?',
      'right': 'Белгісіздік пен тәуекелдің жоғары  дәрежесі',
      'answers': [
        'Белгісіздік пен тәуекелдің жоғары  дәрежесі',
        'Үлкен бюджет, логикалық өзара байланысты процестер',
        'Жобаны жүзеге асыру нәтижесінде пайда табу',
        'Жобаны жүзеге асырудың бағыттары мен принциптері',
        'Шығындарды азайтуды қамтамасыз ету үшін ақпарат алмасу'
      ]
    },
    {
      'title':
          '12. Жобаны бастау – жобаны басқару процесінің кезеңі, нәтижесінде:',
      'right': 'Жобаның басталуы рұқсат етілгені хабарланады',
      'answers': [
        'Жобаның басталуы рұқсат етілгені хабарланады',
        'Жобаның аяқталғаны туралы хабарланады',
        'Үлкейтілген жоба жоспары бекітілді',
        'Ұйымды басқару қажеттіліктері анықталады',
        'Функционалдық оқшаулану ынталандырылады'
      ]
    },
    {
      'title': '13. Жобаның пәндік саласы қандай?',
      'right':
          'Жобаны жүзеге асыру нәтижесінде қамтамасыз етілуі тиіс жобалау жұмыстарының көлемі, тауарлар мен қызметтердің жиынтығы',
      'answers': [
        'Жобаны жүзеге асыру нәтижесінде қамтамасыз етілуі тиіс жобалау жұмыстарының көлемі, тауарлар мен қызметтердің жиынтығы',
        'Жобаны басқару процесін жеңілдететін жобаны жүзеге асыру бағыттары мен принциптері.',
        'Жобаның жасалу себептері өндіріске дейінгі процесті жеңілдетуге көмектеседі',
        'Көмектесетін бірлік – жобадағы ақпаратты өңдеу процесін жеңілдетеді',
        'Көмектесетін бірлік жобаны экономикалық қамтамасыз етуді ұйымдастыру'
      ]
    },
    {
      'title': '14. Критикалық жол әдісінің мақсаты қандай?',
      'right': 'Жобаны іске асыру уақытын қысқарту бағытында оңтайландыру',
      'answers': [
        'Жобаны іске асыру уақытын қысқарту бағытында оңтайландыру',
        'Белгілі бір жобалық процестердің уақытын анықтау үшін',
        'Есептерді дайындау арқылы мүмкін болатын тәуекелдерді анықтау',
        'Сапаны аралық және соңғы бақылау',
        'Алынған нәтижелердің сәйкестігін тексеру'
      ]
    },
    {
      'title': '15. Жобаның құрылымдық ыдырауы дегеніміз:',
      'right':
          'Жоба жұмысының барлық иерархиялық құрылымын графиктер мен диаграммалар түріндегі визуалды ұсыну',
      'answers': [
        'Жоба жұмысының барлық иерархиялық құрылымын графиктер мен диаграммалар түріндегі визуалды ұсыну',
        'Ұйымның құрылымы және жобаны жүзеге асыратын командаға өкілеттіктерді беру',
        'Жобаны жүзеге асыруға қажетті ресурстарды алу және жұмсау графигі',
        'әртүрлі факторлардың әсер ету және теріс нәтиже алу',
        'оң ретінде қабылдаумен сипатталатын оқиғалар немесе жағдайлар жиынтығы'
      ]
    },
    {
      'title':
          '16. Инвестициялық жобаны жүзеге асыру бойынша шешім қабылдау кезінде қандай факторларды ескеру қажет?',
      'right': 'Инфляция, тәуекелдер, альтернативті инвестициялау нұсқалары',
      'answers': [
        'Инфляция, тәуекелдер, альтернативті инвестициялау нұсқалары',
        'Инфляция, жұмыссыздық деңгейі және альтернативті инвестиция нұсқалары',
        'Процестерді блок-схема түрінде көрсету (ағын схемасы)',
        'Инфляция және елдегі саяси жағдай',
        'Бірлесіп жұмыс істейтін ресурстар топтары'
      ]
    },
    {
      'title':
          '17. Жобаны іске асырудың басталуы мен аяқталуы арасындағы уақыт кезеңі қалай аталады?',
      'right': 'Жобаның өмірлік циклі',
      'answers': [
        'Жобаның өмірлік циклі',
        'Жобалау кезеңі',
        'Матрицалық құрылым',
        'Жобаның нәтижесі',
        'ынталандыру құрылымы'
      ]
    },
    {
      'title': 'Microsoft Project ресурстарының мынадай түрлері бар:',
      'right': 'Материалдық, еңбек, шығын',
      'answers': [
        'Материалдық, еңбек, шығын',
        'Материалдық, еңбек, уақытша',
        'Еңбек, қаржылық, уақытша',
        'Жобалық, қаржылық, жарнамалық',
        'Баламалы, тұрақты, уақытша'
      ]
    },
    {
      'title':
          '19.Тек бір тұрақты қызметкері, жоба менеджері бар жоба... матрицалық құрылым болып табылады.',
      'right': 'Әлсіз',
      'answers': ['Әлсіз', 'Жалғыз', 'Қарапайым', 'Жоғары', 'Физикалық']
    },
    {
      'title': '20.Жобаның жарнамасын насихаттайтын жеңілдік қалай аталады?',
      'right': 'Маркетинг',
      'answers': [
        'Маркетинг',
        'Дизайн',
        'Ынталандыру',
        'Бастама',
        'Функционалдық'
      ]
    },
    {
      'title':
          '21.Жоба менеджеріне жобаның мақсаттары мен міндеттеріне сәйкес жұмыс істеуге қабілетті топты ұйымдастыруға көмектесетін екі құрал - ұйымдастыру схемасы және...',
      'right': 'Жауапкершілік матрицасы',
      'answers': [
        'Жауапкершілік матрицасы',
        'ұлғайтылған кесте',
        'Жұмыс сипаттамасы',
        'Үйлестіру кеңесі',
        'шығындар бюджеті'
      ]
    },
    {
      'title':
          '22. Жобаларды қаржыландырудың үш тәсілі: өзін-өзі қаржыландыру, қарыз және... қаражатты пайдалану.',
      'right': 'Тартылған',
      'answers': [
        'Тартылған',
        'Мемлекет',
        'Демеушілік',
        'Ұйымдастырушылық',
        'Инвестор'
      ]
    },
    {
      'title':
          '23. Жобаны жүзеге асыру барысында оның басынан өтетін жағдайлар ... жоба болып табылады.',
      'right': 'Фазалар',
      'answers': ['Фазалар', 'Кезеңдер', 'Кезеңдер', 'Деңгейлер', 'Бөлімдер']
    },
    {
      'title':
          '24. Өзара келісімге негізделген және тиімді, бірақ капиталды көп қажет ететін жобаны жүзеге асыруға бағытталған жобаға қатысушылардың уақытша ерікті бірлестігі қалай аталады?',
      'right': 'Консорциум',
      'answers': [
        'Консорциум',
        'Біріктіру',
        'Интеграция',
        'Белгілі кезең',
        'Дәреже'
      ]
    },
    {
      'title':
          '25. Жобаның өмірлік циклінің соңғы кезеңі қабылдау сынақтарынан және ... тұрады.',
      'right': 'Сынақ операциясы',
      'answers': [
        'Сынақ операциясы',
        'Бақылау түзетулері',
        'Модернизация',
        'Қызмет',
        'Табысты кезең'
      ]
    },
    {
      'title':
          '26. Бір немесе бірнеше жобаларды жүзеге асыруға үнемі қатысатын ұйымдарда қолданылатын жобаларды басқарудың ұйымдық құрылымы қалай аталады?',
      'right': 'Жобаны жалпы басқару',
      'answers': [
        'Жобаны жалпы басқару',
        'Адократиялық',
        'Ана',
        'Аналогтық',
        'Бөлінген'
      ]
    },
    {
      'title':
          '27. Тапсырыс беруші өзінің түпкілікті құнын бастапқымен салыстырғанда ұлғайту туралы шешім қабылдауы мүмкін жоба:',
      'right': 'Қысқа мерзімді',
      'answers': [
        'Қысқа мерзімді',
        'Қарапайым',
        'Ұзақ мерзімді',
        'Еркін',
        'Орташа'
      ]
    },
    {
      'title': '28. Microsoft Project. Ұсыну',
      'right':
          'ортақ жоба деректер қорынан өзара байланысты деректердің бір бөлігін бейнелеу тәсілі',
      'answers': [
        'ортақ жоба деректер қорынан өзара байланысты деректердің бір бөлігін бейнелеу тәсілі',
        'жүйелік терезенің жұмыс аймағында орналасқан жоба деректері бар кесте',
        'жүйелік терезенің жұмыс аймағындағы жоба деректерін көрсететін диаграмма',
        'талдау, бақылау және басқару мақсатында жоба параметрлерін схемалық түрде көрсету',
        'талдау, бақылау және басқару мақсатындағы жоба параметрлерінің өзгеру динамикасы'
      ]
    },
    {
      'title':
          '29. Microsoft Project. Суретте көрсетілген жоба мәліметтері терезесінде Есеп күні параметрінің мәні мынаны көрсетеді:',
      'right':
          'жүйе әртүрлі есеп беру нысандарын жасаған кезде жоба сипаттамалары есептелетін күн',
      'answers': [
        'жүйе әртүрлі есеп беру нысандарын жасаған кезде жоба сипаттамалары есептелетін күн',
        'жобалық есептілікті құру керек кезде ұйым басшылығы белгілеген мақсатты күн',
        'жоба менеджері орындаушылардан жобаның орындалу барысы туралы деректерді жинайтын ең жақын күн',
        'жоба көрсеткіштерін жоспарлау және есептеу аяқталуы тиіс мақсатты күн',
        'жоба менеджері орындаушылардан жоба жұмысының барысы туралы мәліметтерді жинайтын өзгертілген күн'
      ]
    },
    {
      'title':
          '30. Microsoft Project. Алдын ала анықталған негізгі күнтізбе Стандарты келесі жұмыс кестесін көрсетеді:',
      'right':
          '40 сағаттық жұмыс аптасы бір сағаттық үзіліспен және сенбі және жексенбідегі демалыс күндері. Жұмыс уақыты таңғы 9-дан кешкі 6-ға дейін деп есептеледі.',
      'answers': [
        '40 сағаттық жұмыс аптасы бір сағаттық үзіліспен және сенбі және жексенбідегі демалыс күндері. Жұмыс уақыты таңғы 9-дан кешкі 6-ға дейін деп есептеледі.',
        '40 сағаттық жұмыс аптасы бір сағаттық үзіліспен және сенбі және жексенбідегі демалыс күндері. Жұмыс уақыты таңғы 8-ден кешкі 5-ке дейін деп есептеледі.',
        '40 сағаттық жұмыс аптасы жарты сағаттық үзіліспен және сенбі және жексенбідегі демалыс күндері. Жұмыс уақыты 10-нан 1830-ғадейін деп есептеледі',
        'алты күндік, 40 сағаттық жұмыс аптасы демалыс күні жексенбіде және қысқа жұмыс күні сенбі де',
        'жексенбі де демалыс күні және сенбі де қысқа жұмыс күні болатын бес күндік 40 сағаттық жұмыс аптасы'
      ]
    },
  ];

  int rightCount = 0;

  int rightScore() {
    if (rightCount == 30) {
      return 10;
    }
    if (rightCount == 29 || rightCount == 28) {
      return 9;
    }
    if (rightCount >= 25) {
      return 8;
    }
    if (rightCount >= 20) {
      return 7;
    }
    if (rightCount >= 18) {
      return 6;
    }
    if (rightCount >= 15) {
      return 5;
    }
    if (rightCount >= 10) {
      return 4;
    }
    if (rightCount >= 5) {
      return 3;
    }
    if (rightCount >= 2) {
      return 2;
    }
    return 1;
  }

  @override
  void initState() {
    super.initState();
    testData.map((e) => e['answers'].shuffle()).toList();
    currentIndex = 0;
  }

  @override
  Widget build(BuildContext context) {
    var theme = Theme.of(context);
    return Scaffold(
      appBar: AppBar(title: const Text('Тестілеу беті')),
      body: currentIndex < 30
          ? Column(
              mainAxisAlignment: MainAxisAlignment.start,
              crossAxisAlignment: CrossAxisAlignment.start,
              children: [
                const SizedBox(height: 24),
                Padding(
                  padding: const EdgeInsets.symmetric(horizontal: 24),
                  child: Text(
                    testData[currentIndex]['title'],
                    style: theme.textTheme.titleMedium,
                  ),
                ),
                Expanded(
                  child: ListView.builder(
                    itemCount: testData[currentIndex]['answers'].length,
                    itemBuilder: (context, index) {
                      return Container(
                        alignment: Alignment.centerLeft,
                        padding: const EdgeInsets.symmetric(
                          vertical: 6,
                          horizontal: 12,
                        ),
                        child: TextButton(
                          onPressed: () async {
                            setState(() {
                              if (testData[currentIndex]['answers'][index] ==
                                  testData[currentIndex]['right']) {
                                rightCount += 1;
                              }
                              currentIndex += 1;
                            });

                            if (currentIndex == 30) {
                              var db = FirebaseFirestore.instance;
                              var userDoc = await db
                                  .collection('users')
                                  .doc(widget.id)
                                  .get();
                              IUser user = IUser(email: widget.id)
                                  .fromFirestore(userDoc.data()!);
                              user.test = rightScore().toDouble();
                              user.state = true;
                              await db
                                  .collection('users')
                                  .doc(user.email)
                                  .set(user.toFirestore());
                            }
                          },
                          child: Text(
                            testData[currentIndex]['answers'][index],
                          ),
                        ),
                      );
                    },
                  ),
                )
              ],
            )
          : Center(
              child: Column(
                children: [
                  const Card(
                      child: Padding(
                    padding: EdgeInsets.all(8.0),
                    child: Text('Тестілеу сәтті өтті'),
                  )),
                  Card(
                      child: Padding(
                    padding: const EdgeInsets.all(8.0),
                    child: Text('Тестілеу балл нәтижесі: ${rightScore()}'),
                  )),
                  const Card(
                      child: Padding(
                    padding: EdgeInsets.all(8.0),
                    child: Text('Барлық сұрақ: 30'),
                  )),
                  Card(
                      child: Padding(
                    padding: const EdgeInsets.all(8.0),
                    child: Text('Дұрысы: $rightCount'),
                  )),
                ],
              ),
            ),
    );
  }
}
