Repository: zanz9/pas_service
Catalog: lib/l10n/intl_*.arb
Languages: ru

# home
source: Система оценки персонала
ru: Персоналды бағалау жүйесі

# sortBy
source: Сортировка по:
ru: Сұрыптау:

# sortBy_professional
source: Профессиональные
ru: Кәсіби

# sortBy_personal
source: Личностные
ru: Тұлғалық

# sortBy_business
source: Деловые
ru: Іскерлік

# sortBy_integral
source: Интегральные
ru: Интегралдық

# profile_stateTrue
source: Уже подана заявка на оценку
ru: Қазірдің өзінде бағалауға өтінім берілді

# profile_stateFalse
source: Не подана заявка на оценку
ru: Бағалауға өтінім берілген жоқ

# profile_onClickState
source: Подать заявку на оценку
ru: Бағалауға өтініш беру

# user
source: Страница пользователя
ru: Пайдаланушы беті

# user_criteria
source: Критерии оценки
ru: Бағалау критерийлері

# user_professional
source: Профессиональные качества
ru: Кәсіби қасиеттері

# user_professional_knowledge
source: Знания
ru: Білімі

# user_professional_ability
source: Умения
ru: Дағдылары

# user_professional_skills
source: Навыки
ru: Қабілеті

# user_professional_experience
source: Профессиональный опыт
ru: Кәсіби тәжірибесі

# user_professional_qualifications
source: Квалификации
ru: Біліктілігі

# user_professional_resultOfWork
source: Результаты труда
ru: Еңбек нәтижелері

# user_personal
source: Личные качества
ru: Тұлғалық қасиеттері

# user_personal_theAbilityToSelfEsteem
source: Способность к самооценке
ru: Өзін-өзі бағалау қабілеті

# user_personal_morality
source: Нравственность
ru: Адамгершілігі

# user_personal_honesty
source: Честность
ru: Адалдығы

# user_personal_justice
source: Справедливость
ru: Әділдігі

# user_personal_psychologicalStability
source: Психологическая устойчивость
ru: Психологиялық тұрақтылығы

# user_business
source: Деловые качества
ru: Іскерлік қасиеттеі

# user_business_organization
source: Организованность
ru: Ұйымдастыруы

# user_business_responsibility
source: Ответственность
ru: Жауапкершілігі

# user_business_initiative
source: Инициативность
ru: Бастамасы

# user_business_enterprise
source: Предприимчивость
ru: Кәсіпкерлігі

# user_integral
source: Интегральные качества
ru: Интегралдық қасиеттер

# user_integral_authority
source: Авторитет
ru: Билігі

# user_integral_culture
source: Культура
ru: Мәдениеті

# user_integral_thinking
source: Мышление
ru: Ойлауы

# user_integral_speech
source: Речь
ru: Сөйлеуі

# user_start
source: Начать оценку
ru: Бағалауды бастау

# user_cantStart
source: У пользователя пройдена проверка оценки
ru: Пайдаланушы бағалауды тексеруден өтті

# user_validate
source: Оценка пользователя
ru: Пайдаланушыны бағалау

# user_validate_subHeader
source: Критерий оценки
ru: Бағалау критерийі

# loginTitle
source: Авторизация
ru: Кіру беті

# onLogin
source: Войти
ru: Кіру

# dontHaveAccount
source: Нет аккаунта? Зарегистроваться
ru: Тіркелгі жоқ па? Тіркелу

# registerTitle
source: Регистрация
ru: Тіркелу беті

# onRegister
source: Зарегистрироваться
ru: Тіркелу

# haveAccount
source: Уже есть аккаунт? Войти
ru: Есептік жазба бар ма? Кіру

# email
source: Почта
ru: Пошта

# password
source: Пароль
ru: Құпия сөз

# firstName
source: Имя
ru: Аты

# lastName
source: Фамилия
ru: Тегі

# auth_not_found
source: Пользователь не найден
ru: Тіркелгі жоқ

# auth_invalid
source: Неверные данные для входа
ru: Пошта және құпия сөз дұрыс емес
